#include <iostream>   
using namespace std;  
    
int main() {
    int n;                  
    long long result = 1; //змінна для щбередення результату 

    cout << "Введіть число n: ";  
    cin >> n;                     

    // цикл для обчислення подвійного факторіала
    // множимо всі числа тієї ж парності, що й n, від 1 або 2 до n
    for (int i = (n % 2 == 0 ? 2 : 1); i <= n; i += 2) {
        result *= i;  // множимо результат на поточне i
    }

    // очищення екрану 
    system("cls");

    // виводимо результат 
    cout << "Подвійний факторіал числа " << n << " дорвінює " << result << endl;

    // затримка екрану перед закриттям 
    system("pause");
    return 0;  
}
